origin_redis/redis/bench-results/fs_redis_fdp_enabled_everysec/summary_2.txt
====== SET ======
  28835840 requests completed in 636.28 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.151 milliseconds (cumulative count 1)
50.000% <= 0.855 milliseconds (cumulative count 14690715)
75.000% <= 1.047 milliseconds (cumulative count 21807826)
87.500% <= 1.207 milliseconds (cumulative count 25281160)
93.750% <= 1.359 milliseconds (cumulative count 27072438)
96.875% <= 1.519 milliseconds (cumulative count 27945579)
98.438% <= 1.743 milliseconds (cumulative count 28391134)
99.219% <= 2.047 milliseconds (cumulative count 28611304)
99.609% <= 2.679 milliseconds (cumulative count 28723508)
99.805% <= 17.391 milliseconds (cumulative count 28779532)
99.902% <= 25.231 milliseconds (cumulative count 28807689)
99.951% <= 35.263 milliseconds (cumulative count 28821770)
99.976% <= 49.983 milliseconds (cumulative count 28828808)
99.988% <= 56.895 milliseconds (cumulative count 28832330)
99.994% <= 68.287 milliseconds (cumulative count 28834081)
99.997% <= 102.783 milliseconds (cumulative count 28834960)
99.998% <= 164.479 milliseconds (cumulative count 28835406)
99.999% <= 352.767 milliseconds (cumulative count 28835628)
100.000% <= 1017.855 milliseconds (cumulative count 28835735)
100.000% <= 6483.967 milliseconds (cumulative count 28835790)
100.000% <= 6631.423 milliseconds (cumulative count 28835840)
100.000% <= 6631.423 milliseconds (cumulative count 28835840)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.001% <= 0.207 milliseconds (cumulative count 269)
0.123% <= 0.303 milliseconds (cumulative count 35388)
1.349% <= 0.407 milliseconds (cumulative count 388936)
5.104% <= 0.503 milliseconds (cumulative count 1471718)
11.945% <= 0.607 milliseconds (cumulative count 3444332)
25.687% <= 0.703 milliseconds (cumulative count 7407192)
43.565% <= 0.807 milliseconds (cumulative count 12562392)
57.897% <= 0.903 milliseconds (cumulative count 16694980)
71.316% <= 1.007 milliseconds (cumulative count 20564449)
80.613% <= 1.103 milliseconds (cumulative count 23245382)
87.673% <= 1.207 milliseconds (cumulative count 25281160)
92.085% <= 1.303 milliseconds (cumulative count 26553368)
95.059% <= 1.407 milliseconds (cumulative count 27410987)
96.710% <= 1.503 milliseconds (cumulative count 27887241)
97.741% <= 1.607 milliseconds (cumulative count 28184577)
98.290% <= 1.703 milliseconds (cumulative count 28342735)
98.684% <= 1.807 milliseconds (cumulative count 28456221)
98.948% <= 1.903 milliseconds (cumulative count 28532442)
99.158% <= 2.007 milliseconds (cumulative count 28593085)
99.298% <= 2.103 milliseconds (cumulative count 28633336)
99.666% <= 3.103 milliseconds (cumulative count 28739533)
99.705% <= 4.103 milliseconds (cumulative count 28750653)
99.712% <= 5.103 milliseconds (cumulative count 28752760)
99.718% <= 6.103 milliseconds (cumulative count 28754661)
99.724% <= 7.103 milliseconds (cumulative count 28756249)
99.726% <= 8.103 milliseconds (cumulative count 28756973)
99.729% <= 9.103 milliseconds (cumulative count 28757774)
99.733% <= 10.103 milliseconds (cumulative count 28758955)
99.740% <= 11.103 milliseconds (cumulative count 28760880)
99.750% <= 12.103 milliseconds (cumulative count 28763609)
99.762% <= 13.103 milliseconds (cumulative count 28767083)
99.772% <= 14.103 milliseconds (cumulative count 28770161)
99.785% <= 15.103 milliseconds (cumulative count 28773891)
99.795% <= 16.103 milliseconds (cumulative count 28776672)
99.803% <= 17.103 milliseconds (cumulative count 28778998)
99.811% <= 18.111 milliseconds (cumulative count 28781220)
99.817% <= 19.103 milliseconds (cumulative count 28783194)
99.823% <= 20.111 milliseconds (cumulative count 28784715)
99.832% <= 21.103 milliseconds (cumulative count 28787520)
99.845% <= 22.111 milliseconds (cumulative count 28791208)
99.865% <= 23.103 milliseconds (cumulative count 28796801)
99.881% <= 24.111 milliseconds (cumulative count 28801596)
99.900% <= 25.103 milliseconds (cumulative count 28807067)
99.913% <= 26.111 milliseconds (cumulative count 28810832)
99.922% <= 27.103 milliseconds (cumulative count 28813444)
99.933% <= 28.111 milliseconds (cumulative count 28816632)
99.939% <= 29.103 milliseconds (cumulative count 28818355)
99.943% <= 30.111 milliseconds (cumulative count 28819272)
99.944% <= 31.103 milliseconds (cumulative count 28819794)
99.946% <= 32.111 milliseconds (cumulative count 28820310)
99.947% <= 33.119 milliseconds (cumulative count 28820676)
99.949% <= 34.111 milliseconds (cumulative count 28821087)
99.951% <= 35.103 milliseconds (cumulative count 28821693)
99.953% <= 36.127 milliseconds (cumulative count 28822199)
99.955% <= 37.119 milliseconds (cumulative count 28822859)
99.956% <= 38.111 milliseconds (cumulative count 28823225)
99.958% <= 39.103 milliseconds (cumulative count 28823620)
99.958% <= 40.127 milliseconds (cumulative count 28823850)
99.959% <= 41.119 milliseconds (cumulative count 28824076)
99.960% <= 42.111 milliseconds (cumulative count 28824341)
99.961% <= 43.103 milliseconds (cumulative count 28824557)
99.962% <= 44.127 milliseconds (cumulative count 28824917)
99.964% <= 45.119 milliseconds (cumulative count 28825584)
99.967% <= 46.111 milliseconds (cumulative count 28826253)
99.968% <= 47.103 milliseconds (cumulative count 28826652)
99.970% <= 48.127 milliseconds (cumulative count 28827071)
99.972% <= 49.119 milliseconds (cumulative count 28827809)
99.976% <= 50.111 milliseconds (cumulative count 28828948)
99.980% <= 51.103 milliseconds (cumulative count 28829993)
99.982% <= 52.127 milliseconds (cumulative count 28830784)
99.984% <= 53.119 milliseconds (cumulative count 28831140)
99.985% <= 54.111 milliseconds (cumulative count 28831407)
99.985% <= 55.103 milliseconds (cumulative count 28831646)
99.987% <= 56.127 milliseconds (cumulative count 28832070)
99.988% <= 57.119 milliseconds (cumulative count 28832432)
99.989% <= 58.111 milliseconds (cumulative count 28832629)
99.990% <= 59.103 milliseconds (cumulative count 28832908)
99.990% <= 60.127 milliseconds (cumulative count 28833069)
99.991% <= 61.119 milliseconds (cumulative count 28833163)
99.991% <= 62.111 milliseconds (cumulative count 28833232)
99.991% <= 63.103 milliseconds (cumulative count 28833384)
99.992% <= 64.127 milliseconds (cumulative count 28833628)
99.993% <= 65.119 milliseconds (cumulative count 28833838)
99.993% <= 66.111 milliseconds (cumulative count 28833959)
99.994% <= 67.135 milliseconds (cumulative count 28834021)
99.994% <= 68.159 milliseconds (cumulative count 28834072)
99.994% <= 69.119 milliseconds (cumulative count 28834090)
99.994% <= 71.103 milliseconds (cumulative count 28834111)
99.995% <= 72.127 milliseconds (cumulative count 28834287)
99.995% <= 73.151 milliseconds (cumulative count 28834340)
99.995% <= 74.111 milliseconds (cumulative count 28834384)
99.995% <= 75.135 milliseconds (cumulative count 28834490)
99.995% <= 76.159 milliseconds (cumulative count 28834538)
99.996% <= 77.119 milliseconds (cumulative count 28834548)
99.996% <= 78.143 milliseconds (cumulative count 28834606)
99.996% <= 79.103 milliseconds (cumulative count 28834637)
99.996% <= 80.127 milliseconds (cumulative count 28834640)
99.996% <= 84.159 milliseconds (cumulative count 28834690)
99.996% <= 87.103 milliseconds (cumulative count 28834724)
99.996% <= 88.127 milliseconds (cumulative count 28834740)
99.996% <= 92.159 milliseconds (cumulative count 28834752)
99.996% <= 93.119 milliseconds (cumulative count 28834790)
99.997% <= 95.103 milliseconds (cumulative count 28834840)
99.997% <= 96.127 milliseconds (cumulative count 28834852)
99.997% <= 97.151 milliseconds (cumulative count 28834890)
99.997% <= 99.135 milliseconds (cumulative count 28834926)
99.997% <= 100.159 milliseconds (cumulative count 28834940)
99.997% <= 103.103 milliseconds (cumulative count 28834976)
99.997% <= 104.127 milliseconds (cumulative count 28834990)
99.997% <= 109.119 milliseconds (cumulative count 28835034)
99.997% <= 110.143 milliseconds (cumulative count 28835040)
99.997% <= 112.127 milliseconds (cumulative count 28835084)
99.997% <= 113.151 milliseconds (cumulative count 28835090)
99.998% <= 116.159 milliseconds (cumulative count 28835122)
99.998% <= 117.119 milliseconds (cumulative count 28835140)
99.998% <= 137.215 milliseconds (cumulative count 28835148)
99.998% <= 138.111 milliseconds (cumulative count 28835207)
99.998% <= 139.135 milliseconds (cumulative count 28835240)
99.998% <= 149.119 milliseconds (cumulative count 28835268)
99.998% <= 150.143 milliseconds (cumulative count 28835290)
99.998% <= 154.111 milliseconds (cumulative count 28835304)
99.998% <= 155.135 milliseconds (cumulative count 28835329)
99.998% <= 156.159 milliseconds (cumulative count 28835340)
99.998% <= 164.223 milliseconds (cumulative count 28835383)
99.999% <= 165.119 milliseconds (cumulative count 28835430)
99.999% <= 166.143 milliseconds (cumulative count 28835440)
99.999% <= 167.167 milliseconds (cumulative count 28835461)
99.999% <= 168.191 milliseconds (cumulative count 28835490)
99.999% <= 175.103 milliseconds (cumulative count 28835504)
99.999% <= 176.127 milliseconds (cumulative count 28835540)
99.999% <= 192.127 milliseconds (cumulative count 28835566)
99.999% <= 193.151 milliseconds (cumulative count 28835590)
99.999% <= 352.255 milliseconds (cumulative count 28835618)
99.999% <= 353.279 milliseconds (cumulative count 28835640)
99.999% <= 365.311 milliseconds (cumulative count 28835667)
99.999% <= 366.335 milliseconds (cumulative count 28835690)
100.000% <= 1015.295 milliseconds (cumulative count 28835708)
100.000% <= 1016.319 milliseconds (cumulative count 28835720)
100.000% <= 1018.367 milliseconds (cumulative count 28835740)
100.000% <= 6483.967 milliseconds (cumulative count 28835790)
100.000% <= 6627.327 milliseconds (cumulative count 28835807)
100.000% <= 6631.423 milliseconds (cumulative count 28835840)
100.000% <= 6631.423 milliseconds (cumulative count 28835840)
100.000% <= 6631.423 milliseconds (cumulative count 28835840)
[...]

Summary:
  throughput summary: 45319.28 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.989     0.144     0.855     1.407     1.927  6631.423